START = 0
SCHEDULE = 1
INFORMATION = 2
ANSWERED_ALL = 3
ANSWERED_INFORMATION = 4
EVENTS = 5
ANSWERED_EVENTS = 6
DIRECTION_INFORMATION_TEXT = {
    1: 'Яндекс.Лицей — это образовательный проект Яндекса по обучению школьников программированию. '
       'Учебная программа рассчитана на два года. '
       'На занятиях ребята знакомятся с теорией и осваивают технологии на практике.\n\n'
       'Программа подходит старшеклассникам, которые:\n'
       '— Имеют склонность к алгоритмическому мышлению, увлекаются ИТ-технологиями;\n'
       '— Владеют хотя бы одним языком программирования на уровне знания условных и циклических конструкций;\n'
       '— Имеют устойчивые знания по школьному курсу математики.',
    2: 'IT ШКОЛА SAMSUNG была запущена в 2014 году.Курс, '
       'разработанный Российским Исследовательским центром Samsung, '
       'поможет учащимся освоить фундаментальные разделы ИТ и программирования в адаптированной для школьников форме, '
       'получить практические навыки по разработке мобильных приложений в идеологии промышленной индустрии '
       '«от идеи до дистрибуции».\n\n'
       'Программа подходит старшеклассникам, которые :\n'
       '— Имеют склонность к алгоритмическому мышлению, увлекаются ИТ-технологиями;\n'
       '— Владеют хотя бы одним языком программирования на уровне знания условных и циклических конструкций;\n'
       '— Имеют устойчивые знания по школьному курсу математики.',
    3: 'Разработка приложений виртуальной и дополненной реальности — перспективное направление, '
       'в котором можно освоить технологии объемной визуализации и программирования. '
       'Обучающиеся разрабатывают образовательные приложения, проектируют симуляторы для будущих инженеров, '
       'проводят виртуальные туры по культурным и историческим достопримечательностям и др.\n\n'
       'Программа включает:\n'
       '— Очный курс с сертифицированным преподавателем;\n'
       '— Навыки самостоятельной разработки приложений виртуальной (VR), дополненной (AR) и смешанной (MR) '
       'реальности для различных устройств;\n'
       '— Выпускной проект – VR/AR/MR приложение на интересную ребенку тему.',
    4: 'Обучающиеся получают навыки по планированию и проведению исследований интернет-пространства, '
       'количественному и качественному анализу информации, выявлению и систематизации информационных поводов.\n\n'
       'Дети научатся:\n'
       '— Искать достоверную информации в интернете;\n'
       '— Анализировать большие данные;\n'
       '— Безопасно и рационально использовать личные и персональные данные;\n'
       '— Распознавать угрозы в интернет-ресурсах и противодействовать им;\n'
       '— Выявлять закономерности в данных.',
    5: 'В процессе обучения программированию ребята проходят путь от создания простой анимации '
       'до разработки собственной многоуровневой игры на Scratch с сюжетом и звуковым сопровождением\n\n'
       'Дети научатся:\n'
       '— Базовым навыкам работы: объектам, циклам, условным операторам, переменным;\n'
       '— Созданию анимации: сложному сюжету, анимированным героям, озвучиванию и созданию диалогов, дизайну;\n'
       '-Разработке игр: продуманной механике, сценариям, многоуровневости;\n'
       '— Умению читать «чужой код»: как выявлять ошибки и исправлять их.',
    6: 'Создание и программирование роботов и автоматизированных устройств на базе конструкторов LEGO и др.'
       'Конструируя собственные устройства, обучающиеся научатся ставить задачи и находить решения, '
       'получат базовые знания по программированию, а также по физике, механике, электрике, электронике, '
       'проектированию и другим сферам, на стыке которых находится современная робототехника.\n\n'
       'Программа включает:\n'
       '— Очный курс с сертифицированным преподавателем;\n'
       '— Навыки сборки и программирования роботизированных устройств.',
    7: 'Объясним как работают компьютерные сети, '
       'научим администрировать и настраивать компьютеры и другие устройства, '
       'построим сеть с нуля и научимся управлять ею!\n\n'
       'Программа включает:\n'
       '— Сетевое администрирование;\n'
       '— Устройство, сервис и администрирование компьютеров;\n'
       '— Основы функционирования сети Интернет.',
    8: 'Программа направлена на исследования и построение искусственного интеллекта '
       '(а именно базовых алгоритмов машинного обучения и глубокого обучения) '
       'с помощью простого языка и серии кейсов для детей 9-11 классов.\n\n'
       'Минимально необходимый уровень входных компетенций:\n'
       '-Продвинутый уровень работы с компьютером, с базовыми программами (excel, word, powerpoint);\n'
       '-Требуются знания в области программирования (средний — выше среднего);\n'
       '-Требуются знания в математике (средний — выше среднего).',
    9: """Курс в игровой форме научит детей навыкам и понятиям, универсальным для любого языка программирования."""
}
DIRECTION_INFORMATION_AGE = {
    1: "Направление подходит для детей 8-9 классов.",
    2: "Направление подходит для детей 8-10 классов.",
    3: "Направление подходит для детей 12-17 лет.",
    4: "Направление подходит для детей 13-17 лет.",
    5: "Направление подходит для детей 7-12 лет.",
    6: "Направление подходит для детей 11-17 лет.",
    7: "Направление подходит для детей 13-17 лет.",
    8: "Направление подходит для детей 14-17 лет.",
    9: "Направление подходит для детей 7-12 лет"
}
DATABASE_TO_CODE = {
    1: [3, 7, 16],
    2: [1],
    3: [4],
    4: [2],
    5: [8],
    6: [5],
    7: [9],
    8: [6],
    9: [12],
    10: [10],
    11: [11],
    12: [13],
    13: [14],
    14: [15],
    15: [17],
    16: [18]

}

ITCUBE_INFO = 'IT-КУБ - ' \
              'Это центр образования детей по программам, направленным на получение ' \
              'знаний, в сфере информационных технологий.'
